/********************************************************************
filename    :    ivs_sftp_client.h
author      :    yWX150774
created     :    2012/12/14
description :    SFTP客户端
copyright   :    Copyright (c) 2012-2016 Huawei Tech.Co.,Ltd
history     :    2012/12/14 初始版本
*********************************************************************/

#ifndef CBB_SFTP_CLIENT_H
#define CBB_SFTP_CLIENT_H


#include "ivs_uncopy.hpp"

#include "libssh2.h"
#include "libssh2_sftp.h"

#include <string>

NAMESPACE_CBB_BEGIN

/*************************************************************
 *
 * SFTP客户端类, 是一个不可拷贝的类
 *
 ************************************************************/
class EXPORT_DLL CSftpClient : private CUnCopy
{
public:
    CSftpClient();
    ~CSftpClient();

public:
    /*********************************************************
     * 获知系统在当前线程的最后一次错误信息
     ********************************************************/
    static int GetSystemErrno();

    /*********************************************************
     * 以读模式打开本地文件
     ********************************************************/
    static int OpenLocalFileForRead(const char * pszLocalReadFilename);

    /*********************************************************
     * 以写模式打开本地文件
     ********************************************************/
    static int OpenLocalFileForWrite(const char * pszLocalWriteFilename);

public:
    /*********************************************************
     * 设置SFTP服务器的主机名
     ********************************************************/
    void SetHostname(const char * pszHostname);

    /*********************************************************
     * 设置SFTP服务器的主机名
     ********************************************************/
    void SetHostname(const std::string & strHostname);

    /*********************************************************
     * 设置SFTP服务器的端口号, 默认是22
     ********************************************************/
    void SetHostPort(unsigned short usHostPort = 22);

    /*********************************************************
     * 设置登入SFTP服务器的用户名
     ********************************************************/
    void SetUsername(const char * pszUsername);

    /*********************************************************
     * 设置登入SFTP服务器的用户名
     ********************************************************/
    void SetUsername(const std::string & strUsername);

    /*********************************************************
     * 设置登入SFTP服务器的密码
     ********************************************************/
    void SetPassword(const char * pszPassword);

    /*********************************************************
     * 设置登入SFTP服务器的密码
     ********************************************************/
    void SetPassword(const std::string & strPassword);

    /*********************************************************
     * 设置SFTP服务器的当前目录
     ********************************************************/
    void SetRemoteWorkspace(const char * pszRemoteWorkspace);

    /*********************************************************
     * 设置SFTP服务器的当前目录
     ********************************************************/
    void SetRemoteWorkspace(const std::string & strRemoteWorkspace);

    /*********************************************************
     * 获知SFTP服务器的当前目录
     ********************************************************/
    const std::string &  GetRemoteWorkspace() const;

public:
    /*********************************************************
     * 初始化环境
     ********************************************************/
    bool Init();

    /*********************************************************
     * 清理环境
     ********************************************************/
    void Exit();

    /*********************************************************
     * 登入SFTP服务器
     ********************************************************/
    bool Login();

    /*********************************************************
     * 登出SFTP服务器
     ********************************************************/
    void Logout();

    /*********************************************************
     * 在SFTP服务器上创建文件夹 (绝对路径 或 当前工作目录的相对路径)
     ********************************************************/
    bool Mkdir(const char * pszRemoteWorkspace, bool bLogMode = false);

    /*********************************************************
     * 在SFTP服务器上创建文件夹 (绝对路径 或 当前工作目录的相对路径)
     ********************************************************/
    bool Mkdir(const std::string & strRemoteWorkspace, bool bLogMode = false);

    /*********************************************************
     * 在SFTP服务器上创建文件夹 (文件夹名为最近一次设置的工作空间(目录))
     ********************************************************/
    bool Mkdir();

    /*********************************************************
     * 将本地文件上传到SFTP服务器
     ********************************************************/
    bool UploadFile(
        const char * pszLocalReadFilename, 
        const char * pszRemoteWriteFilename,
        bool bLogFileMode = false);

    /*********************************************************
     * 将SFTP服务器文件下载到本地
     ********************************************************/
    bool DownloadFile(
        const char * pszRemoteReadFilename, 
        const char * pszLocalWriteFilename);

private:
    /*********************************************************
     * 创建与SFTP服务器通信的套接字
     ********************************************************/
    bool Connect();

    /*********************************************************
     * 关闭与SFTP服务器通信的套接字
     ********************************************************/
    void Close();

private:
    bool                     m_bSocketInit;          // 是否已经正常初始化网络环境
    bool                     m_bSftpInit;            // 是否已经正常初始化SFTP环境
    int                      m_iSockfd;              // 通信用的套接字
    LIBSSH2_SESSION        * m_pLibssh2Session;      // 用于登入, 验证
    LIBSSH2_SFTP           * m_pLibssh2Sftp;         // 用于传输, 通信

    std::string              m_strHostname;          // SFTP服务器的主机名
    unsigned short           m_usHostPort;           // SFTP服务器的端口号
    std::string              m_strUsername;          // 登入SFTP服务器的用户名
    std::string              m_strPassword;          // 登入SFTP服务器的密码
    std::string              m_strRemoteWorkspace;   // SFTP服务器的当前目录
};

NAMESPACE_CBB_END


#endif // CBB_SFTP_CLIENT_H
